In [11]:
install.packages("dplyr")

Installing package into ‘/home/jrana/R/x86_64-pc-linux-gnu-library/4.2’
(as ‘lib’ is unspecified)

In [12]:
library("dplyr")

In [3]:
s1 <- tibble(
student = c("Adam","Bernd","Christian","Doris"),
algebra = c(NA, 5, 3, 4),
analysis = c(2, NA, 1,3),
diskrete.math = c(3,NA,2,4),
)
s2 <- tibble(
name = rep(c("Adam", "Bernd", "Christian", "Doris"), each = 2),
type = rep(c("height", "weight"), 4),
measure = c(1.83, 81, 1.75, 71, 1.69, 55, 1.57, 62))
s3 <- tibble(
name = c("Adam", "Bernd", "Christian", "Doris"),
ratio = c("81/1.83", "71/1.75", "55/1.69", "62/1.57"))

In [10]:
s1

  student   algebra analysis diskrete.math
1 Adam      NA       2        3
2 Bernd      5      NA       NA
3 Christian  3       1        2
4 Doris      4       3        4

In [5]:
s2

  name      type   measure
1 Adam      height  1.83
2 Adam      weight 81.00
3 Bernd     height  1.75
4 Bernd     weight 71.00
5 Christian height  1.69
6 Christian weight 55.00
7 Doris     height  1.57
8 Doris     weight 62.00

In [6]:
s3

  name      ratio
1 Adam      81/1.83
2 Bernd     71/1.75
3 Christian 55/1.69
4 Doris     62/1.57

## s1
 + contains 3 variables
   + name, exam, grade
 + 36 values and 12 observations

## s2 & s3
 + contains 12 values
 + three variables
   + name, type, measure
 + 3 observation for every student

## why are these datasets not tidy?
  + **s1**
     + column headers are values of the variable exam, not variable name.
  + **s2**
    + the variable weight and height are stored both in cols and rows
  + **s3**
    + the values of weight and height are stored in one column

In [13]:
install.packages("tidyr")

Installing package into ‘/home/jrana/R/x86_64-pc-linux-gnu-library/4.2’
(as ‘lib’ is unspecified)

In [14]:
library("tidyr")

In [18]:
s1  %>% gather("algebra","analysis","diskrete.math",
               key="exam",value="grade")->s1_new
s1_new

   student   exam          grade
1  Adam      algebra       NA
2  Bernd     algebra        5
3  Christian algebra        3
4  Doris     algebra        4
5  Adam      analysis       2
6  Bernd     analysis      NA
7  Christian analysis       1
8  Doris     analysis       3
9  Adam      diskrete.math  3
10 Bernd     diskrete.math NA
11 Christian diskrete.math  2
12 Doris     diskrete.math  4

In [19]:
dim(s1_new)

[1] 12  3

In [20]:
s2

  name      type   measure
1 Adam      height  1.83
2 Adam      weight 81.00
3 Bernd     height  1.75
4 Bernd     weight 71.00
5 Christian height  1.69
6 Christian weight 55.00
7 Doris     height  1.57
8 Doris     weight 62.00

In [18]:
s2 %>% spread(key=type, value=measure)

  name      height weight
1 Adam      1.83   81
2 Bernd     1.75   71
3 Christian 1.69   55
4 Doris     1.57   62